trait T1{
  sm{
    s1{
      e2->s2;
      t1{
       e3-> t2; 
      }
      t2{}
    }
    s2{ }
  }
}
class C1{
  isA T1;
   sm{
    s1{}
    s2{
       e5->s1;
      t1{
       e6-> t2; 
      }
      t2{}
    }
  } 
}